app/controllers/reviews_controller.rb

  def index
    render json: Review.all, include: { user: { only: [:name]  }  }
---
SELECT "reviews".* FROM "reviews"